# RailingSystemSegmentPosts Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroupTypeId..::..RailingSystemSegmentPosts Property
GroupTypeId Class See Also
---
Posts.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public static ForgeTypeId RailingSystemSegmentPosts { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RailingSystemSegmentPosts As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RailingSystemSegmentPosts {
	ForgeTypeId^ get ();
}
```

# See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace